export default function MainSegment({ offset = 0, color, data = "" }: { offset?: number, color?: string, data?: string[] | string }) {

    let segments: Record<string, string[]> = {
        "3": ["0", "1", "2", "3", "4", "7", "8", "9", "A", "B", "D", "H", "J", "M", "N", "O", "P", "Q", "R", "U", "W", "Y", "LINE_TOP_RIGHT", "А", "В", "Д", "И", "Й", "Л", "М", "Н", "О", "П", "Р", "У", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Э", "Ю", "Я"],
        "4": ["0", "1", "2", "3", "4", "7", "8", "9", "A", "B", "D", "H", "J", "M", "N", "O", "P", "Q", "R", "U", "W", "Y", "LINE_TOP_RIGHT", "А", "В", "Д", "И", "Й", "Л", "М", "Н", "О", "П", "Р", "У", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Э", "Ю", "Я"],
        "6": ["0", "1", "2", "3", "4", "7", "8", "9", "A", "B", "D", "H", "J", "M", "N", "O", "P", "Q", "R", "U", "W", "Y", "LINE_TOP_RIGHT", "А", "В", "Д", "И", "Й", "Л", "М", "Н", "О", "П", "Р", "У", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Э", "Ю", "Я"],

        "9": ["0", "1", "3", "4", "5", "6", "7", "8", "9", "A", "B", "D", "G", "H", "J", "M", "N", "O", "Q", "S", "U", "W", "Y", "&", "LINE_BOTTOM_RIGHT", "А", "Б", "В", "Д", "З", "И", "Й", "Л", "М", "Н", "О", "П", "У", "Ц", "Ч", "Ш", "Щ", "Ы", "Ъ", "Ь", "Э", "Ю", "Я"],
        "10": ["0", "1", "3", "4", "5", "6", "7", "8", "9", "A", "B", "D", "G", "H", "J", "M", "N", "O", "Q", "S", "U", "W", "Y", "&", "LINE_BOTTOM_RIGHT", "А", "Б", "В", "Д", "З", "И", "Й", "Л", "М", "Н", "О", "П", "У", "Ц", "Ч", "Ш", "Щ", "Ы", "Ъ", "Ь", "Э", "Ю", "Я"],
        "12": ["0", "1", "3", "4", "5", "6", "7", "8", "9", "A", "B", "D", "G", "H", "J", "M", "N", "O", "Q", "S", "U", "W", "Y", "&", "LINE_BOTTOM_RIGHT", "А", "Б", "В", "Д", "З", "И", "Й", "Л", "М", "Н", "О", "П", "У", "Ц", "Ч", "Ш", "Щ", "Ы", "Ъ", "Ь", "Э", "Ю", "Я"],

        "7": ["0", "2", "6", "8", "A", "C", "E", "F", "G", "H", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "LINE_LEFT", "&", "LINE_BOTTOM_LEFT", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ц", "Ш", "Ы", "Ь", "Ю"],
        "8": ["0", "2", "6", "8", "A", "C", "E", "F", "G", "H", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "LINE_LEFT", "&", "LINE_BOTTOM_LEFT", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ц", "Ш", "Ы", "Ь", "Ю"],
        "11": ["0", "2", "6", "8", "A", "C", "E", "F", "G", "H", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "LINE_LEFT", "&", "LINE_BOTTOM_LEFT", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ц", "Ш", "Ы", "Ь", "Ю"],

        "1": ["0", "4", "5", "6", "8", "9", "A", "C", "E", "F", "G", "H", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "Y", "LINE_LEFT", "LINE_TOP_LEFT", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "У", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Ь", "Ю", "Я"],
        "2": ["0", "4", "5", "6", "8", "9", "A", "C", "E", "F", "G", "H", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "Y", "LINE_LEFT", "LINE_TOP_LEFT", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "У", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Ь", "Ю", "Я"],
        "5": ["0", "4", "5", "6", "8", "9", "A", "C", "E", "F", "G", "H", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "Y", "LINE_LEFT", "LINE_TOP_LEFT", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "У", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Ь", "Ю", "Я"],


        "13": ["0", "2", "3", "5", "6", "7", "8", "9", "A", "B", "C", "D", "E", "F", "G", "I", "O", "P", "Q", "R", "S", "T", "Z", "LINETOP", "&", "LINETOP_SEGMENT-02", "А", "Б", "В", "Г", "Д", "Е", "Ё", "З", "Й", "О", "П", "Р", "С", "Т", "Ф", "Ъ", "Э", "Я"],
        "15": ["0", "2", "3", "5", "6", "7", "8", "9", "A", "B", "C", "D", "E", "F", "G", "I", "O", "P", "Q", "R", "S", "T", "Z", "LINETOP", "&", "LINETOP_SEGMENT-03", "А", "Б", "В", "Г", "Д", "Е", "Ё", "З", "Й", "О", "П", "Р", "С", "Т", "Ф", "Э", "Ю", "Я"],
        "17": ["0", "2", "3", "5", "6", "7", "8", "9", "A", "B", "C", "D", "E", "F", "G", "I", "O", "P", "Q", "R", "S", "T", "Z", "LINETOP", "&", "LINETOP_SEGMENT-01", "А", "Б", "В", "Г", "Д", "Е", "Ё", "З", "О", "П", "Р", "С", "Т", "Ф", "Ъ", "Э", "Я"],
        "20": ["0", "2", "3", "5", "6", "7", "8", "9", "A", "B", "C", "D", "E", "F", "G", "I", "O", "P", "Q", "R", "S", "T", "Z", "LINETOP", "&", "LINETOP_SEGMENT-04", "А", "Б", "В", "Г", "Д", "Е", "Ё", "З", "О", "П", "Р", "С", "Т", "Ф", "Э", "Ю", "Я"],

        "14": ["0", "2", "3", "5", "6", "8", "9", "B", "C", "D", "E", "G", "I", "J", "L", "O", "Q", "S", "U", "Y", "Z", "_", 'LINEBOTTOM', "&", "LINEBOTTOM_SEGMENT-02", "Б", "В", "Д", "Е", "Ё", "З", "О", "С", "У", "Ц", "Ш", "Ь", "Э"],
        "16": ["0", "2", "3", "5", "6", "8", "9", "B", "C", "D", "E", "G", "I", "J", "L", "O", "Q", "S", "U", "Y", "Z", "_", 'LINEBOTTOM', "&", "LINEBOTTOM_SEGMENT-03", "Б", "В", "Д", "Е", "Ё", "З", "О", "С", "У", "Ц", "Ш", "Ъ", "Ь", "Э", "Ю"],
        "18": ["0", "2", "3", "5", "6", "8", "9", "B", "C", "D", "E", "G", "I", "J", "L", "O", "Q", "S", "U", "Y", "Z", "_", 'LINEBOTTOM', "&", "LINEBOTTOM_SEGMENT-01", "Б", "В", "Д", "Е", "Ё", "З", "О", "С", "У", "Ц", "Ш", "Ь", "Э"],
        "19": ["0", "2", "3", "5", "6", "8", "9", "B", "C", "D", "E", "G", "I", "J", "L", "O", "Q", "S", "U", "Y", "Z", "_", 'LINEBOTTOM', "&", "LINEBOTTOM_SEGMENT-04", "Б", "В", "Д", "Е", "Ё", "З", "О", "С", "У", "Ц", "Ш", "Ъ", "Ь", "Э", "Ю"],

        "31": ["2", "3", "4", "5", "6", "8", "9", "A", "E", "F", "H", "K", "P", "R", "Y", "-", "+", "&", "LINE_CENTER_SEGMENT-01", "А", "Б", "Е", "Ё", "К", "Н", "Р", "У", "Ф", "Ч", "Щ", "Ы", "Ь", "Э", "Ю", "Я"],
        "33": ["2", "3", "4", "5", "6", "8", "9", "A", "E", "F", "H", "K", "P", "R", "Y", "-", "+", "&", "LINE_CENTER_SEGMENT-02", "А", "Б", "Е", "Ё", "К", "Н", "Р", "У", "Ф", "Ч", "Щ", "Ы", "Ь", "Э", "Ю", "Я"],
        "34": ["2", "3", "4", "5", "6", "8", "9", "A", "B", "E", "F", "G", "H", "P", "R", "S", "Y", "-", "+", "LINE_CENTER_SEGMENT-03", "А", "Б", "В", "Е", "Ё", "З", "Н", "Р", "У", "Ф", "Ч", "Щ", "Ъ", "Ь", "Э", "Я"],
        "32": ["2", "3", "4", "5", "6", "8", "9", "A", "B", "E", "F", "G", "H", "P", "R", "S", "Y", "-", "+", "LINE_CENTER_SEGMENT-04", "А", "Б", "В", "Е", "Ё", "З", "Н", "Р", "У", "Ф", "Ч", "Щ", "Ъ", "Ь", "Э", "Я"],


        "28": ["B", "D", "I", "T", "!", "+", "=", "|", "В", "Д", "Ж", "Т", "Ф", "Ш", "Щ", "Ъ", "Ю"],
        "30": ["B", "D", "I", "T", "!", "+", "|", "В", "Д", "Ж", "Т", "Ф", "Ш", "Щ", "Ъ", "Ю"],
        "29": ["B", "D", "I", "T", "!", "|", "В", "Д", "Ж", "Т", "Ф", "Ш", "Щ", "Ъ", "Ю"],

        "43": ["B", "D", "I", "T", "!", "|", "В", "Д", "Ж", "Т", "Ф", "Ш", "Ъ", "Ю"],
        "44": ["B", "D", "I", "T", "!", "+", "|", "В", "Д", "Ж", "Т", "Ф", "Ш", "Ъ", "Ю"],
        "42": ["B", "D", "I", "T", "!", "+", "=", "|", "В", "Д", "Ж", "Т", "Ф", "Ш", "Ъ", "Ю"],


        "22": ["K", "M", "V", "X", "Z", "/", "'", "(", "&", "Ж", "З", "И", "Й", "К", "Л", "М", "Х"],
        "23": ["K", "M", "V", "X", "Z", "/", "'", "(", "&", "Ж", "З", "И", "Й", "К", "Л", "М", "Х"],
        "26": ["K", "M", "V", "X", "Z", "/", "'", "(", "=", "&", "Ж", "З", "И", "Й", "К", "Л", "М", "Х"],

        "36": ["K", "N", "Q", "R", "W", "X", "\\", "(", ".", "&", "Ж", "К", "Х", "Ц"],
        "37": ["K", "N", "Q", "R", "W", "X", "\\", "(", ".", "&", "Ж", "К", "Х", "Ц"],
        "40": ["K", "N", "Q", "R", "W", "X", "\\", "(", "=", ".", "&", "Ж", "К", "Х", "Ц"],

        "21": ["M", "N", "S", "X", "\\", ")", "&", "Ж", "М", "Х"],
        "24": ["M", "N", "S", "X", "\\", ")", ":", ";", "&", "Ж", "М", "Х"],
        "25": ["M", "N", "S", "X", "\\", ")", "=", "&", "Ж", "М", "Х"],

        "39": ["V", "W", "X", "Z", "/", ")", "=", ";", ",", "Ж", "И", "Й", "Л", "Х", "Ы", "Я"],
        "38": ["V", "W", "X", "Z", "/", ")", ":", ";", ",", "Ж", "И", "Й", "Л", "Х", "Ы", "Я"],
        "35": ["V", "W", "X", "Z", "/", ")", ";", ",", "Ж", "И", "Й", "Л", "Х", "Ы", "Я"],

    };

    const fillForSegment = (num: number) => {
        if (typeof data === 'string') return (segments[num]?.includes(data.toUpperCase())) ? '#fff' : '';
        return data.some(symbol => segments[num]?.includes(symbol?.toUpperCase() || "")) ? '#fff' : '';
    }

    // 20 17 15 13
    // let segments: number[] = [ ];

    // const fillForSegment = (num: number) => segments.includes(num) ? '#fff' : '';

    // if (["1", "3", "4", "7", "8"].includes(data)) segments.push(3, 4, 6);

    // if (["1", "2", "3", "4", "5", "6", "7", "8"].includes(data)) segments.push(9, 10, 12);



    // if ((data as string) === "2") segments = [3, 4, 6, 7, 8, 11, 13, 14, 15, 16, 17, 18, 19, 20, 31, 32, 33, 34];
    // if ((data as string) === "3") segments = [3, 4, 6, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20, 31, 32, 33, 34];
    // if ((data as string) === "4") segments = [3, 4, 6, 9, 10, 12, 13, 14, 15, 16, 17, 18, 31, 32, 33, 34];

    return (
        // <h1>123</h1>
        <g fill={color} stroke="none" strokeWidth="0" /*transform={`translate(${offset} 0)`}*/>

            <path fill={fillForSegment(1)} d={`M${(89.69799 + offset)},454.9619v-26.70732h8.90244l8.41463,12.31707v14.39024z`} />

            <path fill={fillForSegment(2)} d={`M${(107.01506 + offset)},488.62041v17.68293l-8.41463,12.31707h-8.90244v-30z`} />

            <path fill={fillForSegment(3)} d={`M${(197.62483 + offset)},454.9619v-14.39024l8.41463,-12.31707h8.90244v26.70732z`} />

            <path fill={fillForSegment(4)} d={`M${(214.9419 + offset)},488.62041v30h-8.90244l-8.41463,-12.31707v-17.68293z`} />

            <path fill={fillForSegment(5)} d={`M${(89.75897 + offset)},484.71797v-26.09756h17.31707v26.09756z`} />

            <path fill={fillForSegment(6)} d={`M${(197.4419 + offset)},484.71797v-26.09756h17.31707v26.09756z`} />

            <path fill={fillForSegment(7)} d={`M${(89.69799 + offset)},553.74228v-26.70731h8.90244l8.41463,12.31707v14.39024z`} />

            <path fill={fillForSegment(8)} d={`M${(107.01507 + offset)},587.40078v17.68293l-8.41463,12.31707h-8.90244v-30z`} />

            <path fill={fillForSegment(9)} d={`M${(197.62483 + offset)},553.74228v-14.39024l8.41463,-12.31707h8.90244v26.70731z`} />

            <path fill={fillForSegment(10)} d={`M${(214.9419 + offset)},587.40078v30h-8.90244l-8.41463,-12.31707v-17.68293z`} />

            <path fill={fillForSegment(11)} d={`M${(89.75897 + offset)},583.49835v-26.09756h17.31708v26.09756z`} />

            <path fill={fillForSegment(12)} d={`M${(197.4419 + offset)},583.49835v-26.09756h17.31707v26.09756z`} />

            <path fill={fillForSegment(13)} d={`M${(128.23458 + offset)},436.66922v-20.73171h21.58536v20.73171z`} />

            <path fill={fillForSegment(14)} d={`M${(149.81993 + offset)},604.96184v20.73171h-21.58536v-20.73171z`} />

            <path fill={fillForSegment(15)} d={`M${(154.4541 + offset)},436.66922v-20.73171h21.58536v20.73171z`} />

            <path fill={fillForSegment(16)} d={`M${(176.03945 + offset)},604.96184v20.73171h-21.58536v-20.73171z`} />

            <path fill={fillForSegment(17)} d={`M${(102.86872 + offset)},425.44971v-9.5122h21.58537v20.73171h-13.61354z`} />

            <path fill={fillForSegment(18)} d={`M${(114.98689 + offset)},604.96184h9.46719v20.73171h-21.58537v-9.51219z`} />

            <path fill={fillForSegment(19)} d={`M${(201.28336 + offset)},616.18131v9.51219h-21.58536v-20.73171h9.46719z`} />

            <path fill={fillForSegment(20)} d={`M${(193.43348 + offset)},436.66922h-13.61354v-20.73171h21.58536v9.5122z`} />

            <path fill={fillForSegment(21)} d={`M${(111.28336 + offset)},459.23019v-17.19512h13.29268v17.19512z`} />

            <path fill={fillForSegment(22)} d={`M${(180.30776 + offset)},459.23019v-17.19512h13.29268v17.19512z`} />

            <path fill={fillForSegment(23)} d={`M${(175.4297 + offset)},484.47406v-17.19512h13.29268v17.19512z`} />

            <path fill={fillForSegment(24)} d={`M${(115.4297 + offset)},484.47406v-17.19512h13.29268v17.19512z`} />

            <path fill={fillForSegment(25)} d={`M${(124.15852 + offset)},510.14327v-17.19512h13.29268v17.19512z`} />

            <path fill={fillForSegment(26)} d={`M${(167.67333 + offset)},510.14327v-17.19512h13.29268v17.19512z`} />

            <path fill={fillForSegment(27)} d={`M${(146.72416 + offset)},510.14327v-17.19512h11.35294v17.19512z`} />
            <path fill={fillForSegment(28)} d={`M${(146.72416 + offset)},510.14327v-17.19512h11.35294v17.19512z`} />

            <path fill={fillForSegment(29)} d={`M${(145.79555 + offset)},458.98629v-17.19512h13.29268v17.19512z`} />

            <path fill={fillForSegment(30)} d={`M${(145.79555 + offset)},484.59604v-17.19512h13.29268v17.19512z`} />

            <path fill={fillForSegment(31)} d={`M${(102.44673 + offset)},523.14487l10.59805,-3.83743h11.59951v16.65794h-9.87028z`} />

            <path fill={fillForSegment(32)} d={`M${(189.47634 + offset)},535.96539h-9.87028v-16.65794h11.59951l10.59805,3.83743z`} />

            <path fill={fillForSegment(33)} d={`M${(127.89958 + offset)},536.13898v-16.81107h22.50097v16.81107z`} />

            <path fill={fillForSegment(34)} d={`M${(153.8498 + offset)},536.13898v-16.81107h22.50097v16.81107z`} />

            <path fill={fillForSegment(35)} d={`M${(124.57604 + offset)},583.73727v17.19512h-13.29268v-17.19512z`} />

            <path fill={fillForSegment(36)} d={`M${(193.60043 + offset)},583.73727v17.19512h-13.29268v-17.19512z`} />

            <path fill={fillForSegment(37)} d={`M${(188.72238 + offset)},562.07333v17.19512h-13.29268v-17.19512z`} />

            <path fill={fillForSegment(38)} d={`M${(128.72238 + offset)},562.07333v17.19512h-13.29268v-17.19512z`} />

            <path fill={fillForSegment(39)} d={`M${(137.4512 + offset)},539.98403v17.19512h-13.29268v-17.19512z`} />

            <path fill={fillForSegment(40)} d={`M${(180.96601 + offset)},539.98403v17.19512h-13.29268v-17.19512z`} />

            <path fill={fillForSegment(41)} d={`M${(158.07709 + offset)},539.98403v17.19512h-11.35294v-17.19512z`} />

            <path fill={fillForSegment(42)} d={`M${(158.07709 + offset)},539.98403v17.19512h-11.35294v-17.19512z`} />

            <path fill={fillForSegment(43)} d={`M${(159.08824 + offset)},583.98115v17.19512h-13.29268v-17.19512z`} />

            <path fill={fillForSegment(44)} d={`M${(159.08824 + offset)},561.95134v17.19512h-13.29268v-17.19512z`} />
        </g>
    );
}